wasanwiyarun/psoc_mqtt_wifi_connect_tesa_with_serverTls/proj_cm33_ns/mqtt_task.c
/******************************************************************************
 * Function Name: mqtt_client_task
 ******************************************************************************
 * Summary:
 *  Task for handling initialization & connection of Wi-Fi and the MQTT client.
 *  The task also creates and manages the subscriber and publisher tasks upon 
 *  successful MQTT connection. The task also handles the WiFi and MQTT 
 *  connections by initiating reconnection on the event of disconnections.
 *
 * Parameters:
 *  void *pvParameters : Task parameter defined during task creation (unused)
 *
 * Return:
 *  void
 *
 ******************************************************************************/
void mqtt_client_task(void *pvParameters)
{
    /* Structures that store the data to be sent/received to/from various
     * message queues.
     */
    mqtt_task_cmd_t mqtt_status;
    subscriber_data_t subscriber_q_data;
    publisher_data_t publisher_q_data;
    bool mqtt_client_status = false;

    app_sdio_init();

    /* Configure the Wi-Fi interface as a Wi-Fi STA (i.e. Client). */
    wcm_config.interface = CY_WCM_INTERFACE_TYPE_STA;
    wcm_config.wifi_interface_instance = &sdio_instance;

    /* To avoid compiler warnings */
    (void) pvParameters;

    /* Create a message queue to communicate with other tasks and callbacks. */
    mqtt_task_q = xQueueCreate(MQTT_TASK_QUEUE_LENGTH, sizeof(mqtt_task_cmd_t));

    /* Initialize the Wi-Fi Connection Manager and jump to the cleanup block 
     * upon failure.
     */
    if (CY_RSLT_SUCCESS != cy_wcm_init(&wcm_config))
    {
        CY_ASSERT(0);
    }

    /* Set the appropriate bit in the status_flag to denote successful 
     * WCM initialization.
     */
    status_flag |= WCM_INITIALIZED;
    printf("\nWi-Fi Connection Manager initialized.\n");

    /* Initiate connection to the Wi-Fi AP and cleanup if the operation fails. */
    if (CY_RSLT_SUCCESS == wifi_connect())
    {
        /* Set-up the MQTT client and connect to the MQTT broker.
         * cleanup block if any of the operations fail.
         */
        if ( (CY_RSLT_SUCCESS == mqtt_init()) && (CY_RSLT_SUCCESS == mqtt_connect()) )
        {
            /* Create the subscriber task and cleanup if the operation fails. */
            if (pdPASS == xTaskCreate(subscriber_task, "Subscriber task", SUBSCRIBER_TASK_STACK_SIZE,
                                      NULL, SUBSCRIBER_TASK_PRIORITY, &subscriber_task_handle))
            {
                /* Wait for the subscribe operation to complete. */
                vTaskDelay(pdMS_TO_TICKS(TASK_CREATION_DELAY_MS));

                /* Create the publisher task and cleanup if the operation fails. */
                if (pdPASS == xTaskCreate(publisher_task, "Publisher task", PUBLISHER_TASK_STACK_SIZE,
                                          NULL, PUBLISHER_TASK_PRIORITY, &publisher_task_handle))
                {
                    mqtt_client_status = true;
                }
            }
        }
    }

    if(mqtt_client_status)
    {
        mqtt_client_status = false;
        while (true)
        {
            /* Wait for results of MQTT operations from other tasks and callbacks. */
            if (pdTRUE == xQueueReceive(mqtt_task_q, &mqtt_status, portMAX_DELAY))
            {
                /* In this code example, the disconnection from the MQTT Broker or
                 * the Wi-Fi network is handled by the case 'HANDLE_DISCONNECTION'.
                 *
                 * The publish and subscribe failures (`HANDLE_MQTT_PUBLISH_FAILURE`
                 * and `HANDLE_MQTT_SUBSCRIBE_FAILURE`) does not initiate
                 * reconnection in this example, but they can be handled as per the
                 * application requirement in the following swich cases.
                 */
                switch(mqtt_status)
                {
                    case HANDLE_DISCONNECTION:
                    {
                        /* Deinit the publisher before initiating reconnections. */
                        publisher_q_data.cmd = PUBLISHER_DEINIT;
                        xQueueSend(publisher_task_q, &publisher_q_data, portMAX_DELAY);

                        /* Although the connection with the MQTT Broker is lost,
                         * call the MQTT disconnect API for cleanup of threads and
                         * other resources before reconnection.
                         */
                        cy_mqtt_disconnect(mqtt_connection);

                        /* Check if Wi-Fi connection is active. If not, update the
                         * status flag and initiate Wi-Fi reconnection.
                         */
                        if (cy_wcm_is_connected_to_ap() == 0)
                        {
                            status_flag &= ~(WIFI_CONNECTED);
                            printf("\nInitiating Wi-Fi Reconnection...\n");
                            if (CY_RSLT_SUCCESS == wifi_connect())
                            {
                                printf("\nInitiating MQTT Reconnection...\n");
                                if (CY_RSLT_SUCCESS == mqtt_connect())
                                {
                                    /* Initiate MQTT subscribe post the reconnection. */
                                    subscriber_q_data.cmd = SUBSCRIBE_TO_TOPIC;
                                    xQueueSend(subscriber_task_q, &subscriber_q_data, portMAX_DELAY);

                                    /* Initialize Publisher post the reconnection. */
                                    publisher_q_data.cmd = PUBLISHER_INIT;
                                    xQueueSend(publisher_task_q, &publisher_q_data, portMAX_DELAY);
                                    mqtt_client_status = true;
                                }
                            }
                        }
                        break;
                    }

                    default:
                        break;
                }
            }
            if(!mqtt_client_status){
                terminate_tasks();
                break;
            }
        }
    }else
    {
        terminate_tasks();
    }
}

#if GENERATE_UNIQUE_CLIENT_ID
/******************************************************************************
 * Function Name: mqtt_get_unique_client_identifier
 ******************************************************************************
 * Summary:
 *  Function that generates unique client identifier for the MQTT client by
 *  appending a timestamp to a common prefix 'MQTT_CLIENT_IDENTIFIER'.
 *
 * Parameters:
 *  char *mqtt_client_identifier : Pointer to the string that stores the 
 *                                 generated unique identifier
 *
 * Return:
 *  cy_rslt_t : CY_RSLT_SUCCESS on successful generation of the client 
 *              identifier, else a non-zero value indicating failure.
 *
 ******************************************************************************/
static cy_rslt_t mqtt_get_unique_client_identifier(char *mqtt_client_identifier)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;

    /* Check for errors from snprintf. */
    if (0 > snprintf(mqtt_client_identifier,
                     (MQTT_CLIENT_IDENTIFIER_MAX_LEN + 1),
                     MQTT_CLIENT_IDENTIFIER "%lu",
                     (long unsigned int)Clock_GetTimeMs()))
    {
        status = ~CY_RSLT_SUCCESS;
    }

    return status;
}
#endif /* GENERATE_UNIQUE_CLIENT_ID */

/* [] END OF FILE */
